# Напишите функцию, которая отображает на экран форматированный текст, указанный ниже:

def Bill_Gates_quote():
    print('“Don\'t compare yourself with anyone in this world...')
    print('if you do so, you are insulting yourself.”')
    print('\t\t\t\t\t\t\t\t\t\t\t Bill Gates')


Bill_Gates_quote()
